Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: A Boolean value indicating whether this character is a letter.
ja: この表意文字が表音文字であるかどうかを指し示すブール値。

source: A Boolean value indicating whether this character is considered lowercase.
ja: この文字がローワーケースであると考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether this character is considered uppercase.
ja: この文字がアッパーケースと考えられるかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a currency symbol.
ja: この文字が通貨記号を表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a hexadecimal digit.
ja: この文字が16進法桁を表しているかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a newline.
ja: この文字がニューラインを表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a number.
ja: この文字がある数を表しているかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a symbol that naturally appears in mathematical contexts.
ja: この文字が数学的文脈において自然に現れるシンボルを表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a symbol.
ja: この文字がシンボルを表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents a whole number.
ja: この文字が整数を表しているかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents punctuation.
ja: この文字が句読点を表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this character represents whitespace, including newlines.
ja: この文字が空白を、ニューラインを含めて、表すかどうかを指し示すブール値。

source: A Boolean value indicating whether this instance is finite.
ja: このインスタンスが有限であるかどうかを指し示すブール値。

source: A Boolean value indicating whether this instance is normal.
ja: このインスタンスがノーマルであるかどうかを指し示すブール値。

source: A Boolean value indicating whether this is an ASCII character.
ja: それがASCII文字かどうかを指し示しているブール値。

source: A Boolean value indicating whether this type is a signed integer type.
ja: この型が符号付き整数型であるかどうかを指し示すブール値。

source: A Boolean value that indicates whether the dictionary is empty.
ja: 辞書が空かどうかを指し示すブール値。

source: A NaN compares not equal, not greater than, and not less than every value, including itself.
ja: NaNは、それ自身を含めてあらゆる値に対して等しくない、大きくない、少なくないと比較されます。

source: A NaN passed as other results in another NaN, with a signaling NaN value converted to quiet NaN.
ja: otherとして渡されるNaNは、シグナルNaN値はクワイエットNaNに変換されて、別のNaNという結果になります。

source: A NaN passed as value results in another NaN, with a signaling NaN value converted to quiet NaN.
ja: valueとして渡されるNaNは、シグナルNaN値はクワイエットNaNに変換されて、別のNaNという結果になります。

source: A NaN value may also include a payload in parentheses following the "nan" keyword.
ja: あるNaN値はまた、"nan"キーワードに続けて丸括弧の中にペイロードを含むことができます。

source: A UTF-16 encoding of self.
ja: selfのUTF-16符号化。

source: A UTF-8 encoding of self.
ja: selfのUTF-8符号化。

source: A Unicode string value that is a collection of characters.
ja: あるユニコード文字列値、それは、いくらかの文字からなる１つのコレクションです。

source: A binary floating-point type’s exponentBitCount imposes a limit on the range of the exponent for normal, finite values.
ja: バイナリ浮動小数点型のもつexponentBitCountは、正規化数の、有限の値に対する指数の範囲に限界を課します。

source: A bit pattern to use for the address of the new pointer.
ja: 新しいポインタのアドレスのために使われるビットパターン。

source: A bitwise AND operation results in a value that has each bit set to 1 where both of its arguments have that bit set to 1.
ja: ビット単位AND演算は、ある値という結果になります、それが各ビットを1に設定するのは、両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise OR operation results in a value that has each bit set to 1 where one or both of its arguments have that bit set to 1.
ja: ビット単位OR演算は、ある値という結果になります、それが各ビットを1に設定するのは、一方または両方のそれの引数が、そのビットを1に設定するところです。

source: A bitwise XOR operation, also known as an exclusive OR operation, results in a value that has each bit set to 1 where one or the other but not both of its arguments had that bit set to 1.
ja: ビット単位XOR演算、または排他的OR演算として知られるものは、１つの値という結果になり、それは各ビットが1に設定されます、そこにおいて一方または他方しかし両方でなくそれの引数がそのビットを1に設定されます。

source: A callback to invoke when iteration of a AsyncStream is cancelled.
ja: AsyncStreamの反復が取り消される時に発動するコールバック。

source: A callback to invoke when iteration of a AsyncThrowingStream is cancelled.
ja: AsyncThrowingStreamの反復が取り消される時に発動するコールバック。

source: A character with the value “\r\n” (CR-LF) is normalized to “\n” (LF) and has an asciiValue property equal to 10.
ja: 値 “\r\n” (CR-LF) を持つある文字は、“\n” (LF) に正規化されます、そして10に等しいasciiValueプロパティを持ちます。

source: A class of types whose instances hold the value of an entity with stable identity.
ja: それらのインスタンスはある登録項目の値を安定した同一性で保持するところの型それらのクラス。

source: A closure that accepts an inout state and returns the next element of the sequence.
ja: inout状態を受け取り、そしてそのシーケンスの次の要素を返すクロージャ。

source: A closure that accepts an element of this sequence as its argument and returns a sequence or collection.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、あるシーケンスまたはコレクションを返すものです。

source: A closure that accepts an element of this sequence as its argument and returns an optional value.
ja: あるクロージャ、それはこのシーケンスのひとつの要素をそれの引数として受け取って、ひとつのオプショナルの値を返すものです。

source: A closure that accepts the previous sequence element and returns the next element.
ja: あるクロージャ、それは前のシーケンス要素を受け取り、次の要素を返します。

source: A closure that combines an accumulating value and an element of the asynchronous sequence into a new accumulating value, for use in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それは蓄積値と非同期シーケンスのいち要素を新しい蓄積値へと結合します、nextPartialResultクロージャの次の呼び出しにおいて使うためにまたは呼び出し側に返されるように。

source: A closure that combines an accumulating value and an element of the sequence into a new accumulating value, to be used in the next call of the nextPartialResult closure or returned to the caller.
ja: あるクロージャ、それは蓄積値をシーケンスのいち要素と結合して新しい蓄積値とし、nextPartialResultクロージャの次の呼び出しにおいて使われるか、呼び出し側に返されるようにします。

source: A closure that is called with the values for any duplicate keys that are encountered.
ja: あるクロージャで、出くわす何らかの重複キーに対するそれら値とともに呼ばれます。

source: A closure that is executed immediately with an escapable copy of closure as its argument.
ja: closureの脱出可能コピーをそれの引数として使い直ちに実行されるクロージャ。

source: A closure that processes one outputEncoding code unit at a time.
ja: あるクロージャ、それは一度に１つのoutputEncodingコードユニットを処理します。

source: A closure that returns true if its argument should be used to split the sequence; otherwise, false.
ja: １つのクロージャ、それはそれの引数が使われてシーケンスを分割するならばtrueを；そうでなければ、falseを返します。

source: A closure that returns a Boolean value indicating whether two elements are equivalent.
ja: ２つの要素が等しいかどうかを指し示しているブール値を返すクロージャ。

source: A closure that returns a key for each element in values.
ja: valuesの中の各要素に対するキーを返すクロージャ。

source: A closure that returns an optional element.
ja: あるクロージャ、それはあるオプショナルの要素を返します。

source: A closure that takes a CheckedContinuation parameter.
ja: あるクロージャ、それはCheckedContinuationバラメータを取ります。

source: A closure that takes a key-value pair as its argument and returns a Boolean value indicating whether the pair should be included in the returned dictionary.
ja: キー値ペアをそれの引数として取り、返される辞書にそのペアが含まれるべきかどうかを指し示すブール値を返します。

source: A closure that takes a mutable pointer to value as its sole argument.
ja: valueへの可変ポインタをそれの唯一の引数として取るクロージャ。

source: A closure that takes a pointer to value as its sole argument.
ja: valueへのポインタをそれの唯一の引数として取るクロージャ。

source: A closure that takes a raw buffer pointer to the bytes of value as its sole argument.
ja: valueのバイトへの生のバッファポインタをそれの唯一の引数として取るクロージャ。

source: A closure that takes an UnsafeContinuation parameter.
ja: あるクロージャ、それはUnsafeContinuationバラメータを取ります。

source: A closure that takes an UnsafeCurrentTask parameter.
ja: あるクロージャ、それはUnsafeCurrentTaskバラメータを取ります。

source: A closure that takes an element as a parameter and returns a Boolean value indicating whether the element should be included in the modified sequence.
ja: あるクロージャ、それはある要素をパラメータとして取り、その要素がこの修正後のシーケンスに含まれるべきかどうかを指し示すブール値を返すものです。

source: A closure that takes an element as a parameter and returns a Boolean value indicating whether to drop the element from the modified sequence.
ja: あるクロージャ、それはある要素をパラメータとして取り、その要素をこの修正後のシーケンスから抜かすことになるかどうかを指し示すブール値を返すものです。

source: A closure that takes an element as an argument and returns a Boolean value indicating whether the collection should be split at that element.
ja: あるクロージャ、それは１つの要素を引数として取り、コレクションがその要素で分割されるかどうかを指し示すブール値を返します。

source: A closure that takes an element as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それは１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the element is a match.
ja: あるクロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素があるマッチであるかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこの非同期シーケンスの１つの要素をそれの引数として取り、渡された要素があるマッチを表すかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこの非同期シーケンスの１つの要素をそれの引数として取り、渡された要素がある条件を満たすかどうかを指し示すブール値を返します。

source: A closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether to include the element in the filtered sequence.
ja: あるクロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素をこの平坦化されたシーケンスに含むことになるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as a parameter.
ja: あるクロージャ、それはシーケンスの１要素を引数として取ります。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be included or false if it should be excluded.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が含まれるべきならばtrueをまたはそれが除外されるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns true if the element should be skipped or false if it should be included.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が省かれるべきならばtrueをまたはそれが含まれるべきならばfalseを返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element is a match.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が合致するものかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the result.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が結果に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be included in the returned array.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素が返される配列に含まれるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value indicating whether the element should be removed from the collection.
ja: あるクロージャ、それはシーケンスの１つの要素をそれの引数として取り、その要素がコレクションから除去されるべきかどうかを指し示しているブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element represents a match.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素が合致するものであるかどうかを指し示すブール値を返します。

source: A closure that takes an element of the sequence as its argument and returns a Boolean value that indicates whether the passed element satisfies a condition.
ja: あるクロージャ、それはこのシーケンスの１つの要素をそれの引数として取り、渡された要素がある条件を満たすかどうかを指し示すブール値を返します。

source: A closure that takes the current and new values for any duplicate keys.
ja: あるクロージャで、何らかの重複キーに対する現在および新しい値それぞれをとるもの。

source: A closure that transforms a value.
ja: 値を変換するクロージャ。

source: A closure that updates the accumulating value with an element of the sequence.
ja: 蓄積される値をこのシーケンスのある要素を使って更新するクロージャ。

source: A closure to execute that depends on the lifetime of x being extended.
ja: 延長されているxの生涯に依存して実行するクロージャ。

source: A closure with a CVaListPointer parameter that references the arguments passed as args.
ja: argsとして渡される引数を参照するCVaListPointerパラメータを持つクロージャ。

source: A closure with an UnsafeBufferPointer parameter that points to the contiguous storage for the array.
ja: あるクロージャでUnsafeBufferPointerパラメータを持ち、それはその配列のための隣接ストレージを指し示します。

source: A closure with an UnsafeMutableBufferPointer parameter that points to the contiguous storage for the array.
ja: あるクロージャでUnsafeMutableBufferPointerパラメータを持ち、それはその配列のための隣接ストレージを指し示します。

source: A closure with an UnsafeMutableRawBufferPointer parameter that points to the contiguous storage for the array.
ja: あるクロージャでUnsafeMutableRawBufferPointerパラメータを持ち、それはその配列のための隣接ストレージを指し示します。

source: A closure with an UnsafeRawBufferPointer parameter that points to the contiguous storage for the array.
ja: あるクロージャでUnsafeRawBufferPointerパラメータを持ち、それはその配列のための隣接ストレージを指し示します。

source: A collection and its slices share the same indices.
ja: コレクションとそれのスイラスは同じインデックスを共有します。

source: A collection containing a single element.
ja: 単一の要素を含んでいるコレクション。

source: A collection containing just the keys of the dictionary.
ja: 辞書のキーだけを含んでいるコレクション。

source: A collection containing just the values of the dictionary.
ja: 辞書の値だけを含んでいるコレクション。

source: A collection containing the words of this value’s binary representation, in order from the least significant to most significant.
ja: この値の持つバイナリ表現の単語いくらかを含んでいるコレクション、最下位から最上位への順番で。

source: A collection difference with all possible moves inferred.
ja: 可能な限り移動それらが推測された状態でのあるコレクション差異。

source: A collection of all values of this type.
ja: この型の全ての値からなるコレクション。

source: A collection of changes that represent a transition between two states.
ja: ２つの状態の間の推移を表す変更いくつからなるあるコレクション。

source: A collection of indices for an arbitrary collection
ja: 不定なコレクションのためのインデックスのコレクション

source: A collection of insertions and removals that describe the difference between two ordered collection states.
ja: ２つの順序付きコレクション状態の間の差異を記述するいくらかの挿入と除去からなるあるコレクション。

source: A collection or finite sequence.
ja: コレクションまたは有限のシーケンス。

source: A collection that contains count elements that are all element.
ja: count個の要素を含んでいるコレクション、それはすべてがelementです。

source: A collection that presents the elements of its base collection in reverse order.
ja: あるコレクション、それは、それの基盤コレクションの要素を逆順で提示します。

source: A collection that supports backward as well as forward traversal.
ja: 前方にだけでなく後方へ辿っていくこともサポートするコレクション。

source: A collection that supports efficient random-access index traversal.
ja: 効率のよい無作為アクセスのインデックス探査をサポートするコレクション。

source: A collection whose element type is Element but that is always empty.
ja: それの要素型はElementである、しかし常に空であるコレクション。

source: A collection whose elements are all identical.
ja: あるコレクション、その要素は全て同一です。

source: A collection whose elements are key-value pairs.
ja: それの要素がキー値ペアであるコレクション。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be non-uniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが特有にでなくとも参照されるようにします。

source: A collection’s indices property can hold a strong reference to the collection itself, causing the collection to be nonuniquely referenced.
ja: あるコレクションのindicesプロパティは、そのコレクション自身に対する強い参照を保持でき、そのコレクションが非特有に参照されるようにします。

source: A conforming type may contain a subset of values which are treated as exceptional—that is, values that are outside the domain of meaningful arguments for the purposes of the Comparable protocol.
ja: 準拠している型は、普通でないものとして扱われる値の下位集合を含むでしょう — すなわち、Comparableプロトコルの用途のための意味のある引数の領域の外側である値。

source: A conforming type may use any integer radix, but values other than 2 (for binary floating-point types) or 10 (for decimal floating-point types) are extraordinarily rare in practice.
ja: 準拠する型は、あらゆる整数基数を使うことができます、しかし２（バイナリ浮動小数点型に対して）または10（10進浮動小数点型に対して）より他の値は、実際には非常に稀です。

source: A contiguously stored array.
ja: 隣接保管の配列。

source: A continuation must be resumed exactly once.
ja: 継続は、厳密に一度だけ再開されなければなりません。

source: A custom playground Quick Look for the Bool instance.
ja: Boolインスタンスのためのあつらえのプレイグラウンドクイックルック。

source: A custom playground Quick Look for the Character instance.
ja: Characterインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Double instance.
ja: Doubleインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Float instance.
ja: Floatインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Int16 instance.
ja: Int16インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Int32 instance.
ja: Int32インスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground Quick Look for the Int instance.
ja: Intインスタンスのためのあつらえのプレイグラウンド「クイックルック」。

source: A custom playground description for this instance.
ja: このインスタンスに対するあつらえのplayground記述。

source: A decimal value may also include an exponent following the significand, indicating the power of 10 by which the significand should be multiplied.
ja: 10進の値はまた、それによって仮数が乗算されるべき10の冪を指し示す指数を、仮数に続けて含んでも構いません。

source: A description of what went wrong, for debugging purposes.
ja: 何がうまくいかなかったかの記述、デバッグ目的のため。

source: A dictionary containing the keys and non-nil transformed values of this dictionary.
ja: この辞書のキーと非nilの変換済値を含んでいるある辞書。

source: A dictionary containing the keys and transformed values of this dictionary.
ja: この辞書のキーと変換された値を含んでいる辞書。

source: A dictionary is a type of hash table, providing fast access to the entries it contains.
ja: 辞書はある種のハッシュテーブルであり、それが含んでいる登録項目への高速なアクセスを提供します。

source: A dictionary literal is not the same as an instance of Dictionary.
ja: 辞書リテラルは、Dictionaryのインスタンスと同じではありません。

source: A dictionary literal is a comma-separated list of key-value pairs, in which a colon separates each key from its associated value, surrounded by square brackets.
ja: 辞書リテラルは、「キーと値」の組（キー値ペア）のコンマ区切りのリストで角括弧で囲まれています、このキー値ペアではコロンが各キーをそれの関連値から切り離します。

source: A dictionary literal is a simple way of writing a list of key-value pairs.
ja: 辞書リテラルは、「キー値」ペアのリストを書く簡単な方法です。

source: A dictionary of the key-value pairs that isIncluded allows.
ja: isIncludedが認めるキー値ペアからなる辞書。

source: A dictionary to merge.
ja: 結合することになる辞書。

source: A dictionary value converts to an MLDataValue.ValueType.dictionary.
ja: 辞書値は、MLDataValue.ValueType.dictionaryに変わります。

source: A dictionary’s indices stay valid across additions to the dictionary as long as the dictionary has enough capacity to store the added values without allocating more buffer.
ja: 辞書のインデックスは、その辞書への追加をまたいで有効なままです、加えられた値をもっとバッファを割り当てることなく格納するために辞書が十分な容量を持つ限りは。

source: A double value converts to an MLDataValue.ValueType.double.
ja: double値は、MLDataValue.ValueType.doubleに変わります。

source: A double-precision, floating-point value type.
ja: 倍精度、浮動小数点値型。

source: A error-throwing closure that takes an element of the asynchronous sequence as its argument and returns a Boolean value that indicates whether to include the element in the modified sequence.
ja: あるエラースロークロージャ、それは非同期シーケンスの１つの要素をそれの引数として取り、その要素をこの修正されたシーケンスに含むことになるかどうかを指し示すブール値を返します。

source: A false value.
ja: あるfalse値。

source: A flattened view of the elements of this sequence of sequences.
ja: 複数のシーケンスからなるこのシーケンスの要素のある平坦なビュー。

source: A floating-point numeric type.
ja: 浮動小数点数値型。

source: A floating-point value to be converted.
ja: 変換されることになる浮動小数点値。

source: A floating-point value to compare to this value.
ja: この値と比較される浮動小数点値。

source: A floating-point value to convert to an integer.
ja: 整数へと変換する浮動小数点値．

source: A floating-point value.
ja: ある浮動小数点値。

source: A half-open interval from a lower bound up to, but not including, an upper bound.
ja: 下側の境界から、上側の境界まで、しかしそれを含んでいない、半開間隔。

source: A half-precision (16b), floating-point value type.
ja: 半精度（16b）、浮動小数点値型。

source: A hashable value to wrap.
ja: ラップすることになるハッシュ可能値。

source: A hexadecimal value may also include an exponent following the significand, indicating the power of 2 by which the significand should be multiplied.
ja: 16進数値はまた、それによって仮数が乗算されるべき２の冪を指し示す指数を、仮数に続けて含んでも構いません。

source: A key path from a specific root type to a specific resulting value type.
ja: 特定の根本の型から特定の結果値の型へのキーパス。

source: A key path from the root of this key path and the value type of path, if path can be appended.
ja: このキーパスのルートからのキーパスとpathの値型、もしpathが追加されるならば。

source: A key path from the root of this key path to the value type of path, if path can be appended.
ja: このキーパスのルートからpathの値型へのキーパス、もしpathが追加できるならば。

source: A key path from the root of this key path to the value type of path.
ja: このキーパスのルートから、pathの値型へのキーパス。

source: A keyed decoding container view into this decoder.
ja: このデコーダへのキー付きデコーディングコンテナビュー。

source: A label to use when writing the contents of value.
ja: valueの内容を書き込むときに使うラベル。

source: A lightweight collection of key-value pairs.
ja: キー値ペアの軽量コレクション。

source: A mapping closure.
ja: マップを行うクロージャ。

source: A mechanism to interface between synchronous and asynchronous code, logging correctness violations.
ja: 同期と非同期のコードの間を取り持つためのある仕組み、それは正確さ侵害を記録します。

source: A mechanism to interface between synchronous and asynchronous code, without correctness checking.
ja: 同期と非同期のコードの間を取り持つための仕組み、正確さ検査なしで。

source: A mirror that reflects the Bool instance.
ja: Boolインスタンスを反映するミラー。

source: A mirror that reflects the Character instance.
ja: Characterインスタンスを反映するミラー。

source: A mirror that reflects the Double instance.
ja: Doubleインスタンスを反映するミラー。

source: A mirror that reflects the Float instance.
ja: Floatインスタンスを反映するミラー。

source: A mirror that reflects the Int16 instance.
ja: Int16インスタンスを反映するミラー。

source: A mirror that reflects the Int32 instance.
ja: Int32インスタンスを反映するミラー。

source: A mirror that reflects the Int instance.
ja: Intインスタンスを反映するミラー。

source: A mirror that reflects the Float80 instance.
ja: Float80インスタンスを反映するあるミラー。

source: A mirror that reflects the array.
ja: その配列を反映するミラー。

source: A mirror that reflects the dictionary.
ja: その辞書を反映するミラー。

source: A mirror that reflects the iterator.
ja: そのイテレータを反映するミラー。

source: A mutable pointer addressing an Objective-C reference that doesn’t own its target.
ja: それのターゲットを所有しないObjective-C参照をアドレス指定している可変ポインタ。

source: A negative value that uses the full precision of the floating-point type.
ja: 負の値、それは浮動小数点型の最大精度を使います。

source: A negative, nonzero number that does not use the full precision of the floating-point type.
ja: 負の、非ゼロの数、それは浮動小数点型の最大精度を使いません。

source: A new .dataCorrupted error with the given information.
ja: を与えられた情報を持つ新しい.dataCorruptedエラー。

source: A new dictionary initialized with the elements of keysAndValues.
ja: keysAndValuesの要素で初期化された新しい辞書。

source: A new dictionary with the combined keys and values of this dictionary and other.
ja: この辞書とotherのキーと値を組み合わせた新しい辞書。

source: A new empty single value container.
ja: 新しい空の単一値コンテナ。

source: A new empty unkeyed container.
ja: 新しい空のキー付けされないコンテナ。

source: A new instance initialized with rawValue will be equivalent to this instance.
ja: rawValueで初期化された新しいインスタンスは、このインスタンスに相当します。

source: A new instance of type U, cast from x.
ja: 型Uの新しいインスタンス、xからキャストされます。

source: A new keyed encoding container.
ja: 新しいキー付けされるエンコーディングコンテナ。

source: A new range clamped to the bounds of limits.
ja: limitsの境界内に制限された、新しい範囲。

source: A nil-coalescing operation unwraps the left-hand side if it has a value, or it returns the right-hand side as a default.
ja: nil合体演算は、左手側をそれが値を持つならばアンラップします、またはそれは右手側を省略時のものとして返します。

source: A nil-coalescing operation unwraps the left-hand side if it has a value, or returns the right-hand side as a default.
ja: nil合体演算は、左手側をそれが値を持つならばアンラップします、または右手側を省略時のものとして返します。

source: A non-nil associatedWith value is the offset of the complementary change.
ja: 非nilのassociatedWith値は、補足的変更のオフセットです。

source: A nonescaping closure value that is made escapable for the duration of the execution of the body closure.
ja: 非脱出クロージャ値で、bodyクロージャの実行の間に脱出可能にされるもの。

source: A numeric value.
ja: ある数値。
